# GetNumTexLayers

## Description
Returns number of texture layers (base + decals) for the specified part.

```pascal
FUNCTION GetNumTexLayers(
				obj       : HANDLE;
				texPartID : LONGINT) : LONGINT;
```

```python

def vs.GetNumTexLayers(obj, texPartID):
    return LONGINT
```

## Parameters
|Name|Type|Description|
|---|---|---|
|obj|HANDLE||
|texPartID|LONGINT||

## Version
Availability: from Vectorworks 2010
## Category
* Textures